levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/inc/hc32m423_tmr4.h
    uint16_t u16ExtendMatch;                /*!< Extend the match condition
                                                 This parameter can be a value of @ref TMR4_OCO_Extend_Match_Condtion */
} stc_oco_low_ch_compare_mode_t;

/**
 * @brief TMR4 Output Compare(OCO) initialization configuration
 */
typedef struct
{
    uint16_t u16CompareVal;         /*!< TMR4 OCO compare match value.
                                         This parameter can be a value of half-word */

    uint16_t u16OccrBufMode;        /*!< Buffer register function of OCCR
                                         This parameter can be a value of @ref TMR4_OCO_OCCR_Buffer_Mode */

    uint16_t u16OccrLinkTransfer;   /*!< Enable or disable the OCCR buffer linked transfer with the CNT interrupt mask counter
                                         This parameter can be a value of @ref TMR4_OCO_OCCR_Link_Transfer */

    uint16_t u16OcmrBufMode;        /*!< Buffer register function of OCMR
                                         This parameter can be a value of @ref TMR4_OCO_OCMR_Buffer_Mode */

    uint16_t u16OcmrLinkTransfer;   /*!< Enable or disable the OCMR buffer linked transfer with the CNT interrupt mask counter
                                         This parameter can be a value of @ref TMR4_OCO_OCMR_Link_Transfer */

    uint16_t u16OcoInvalidOp;       /*!< Port output polarity when OCO is invalid
                                         This parameter can be a value of @ref TMR4_OCO_Invalid_Output_Polarity */

    uint16_t u16OcoCmd;             /*!< Enable or disable OCO function
                                         This parameter can be a value of @ref TMR4_OCO_State */
} stc_tmr4_oco_init_t;

/**
 * @brief TMR4 PWM initialization configuration
 */
typedef struct
{
    uint16_t u16Mode;               /*!< Select PWM mode
                                         This parameter can be a value of @ref TMR4_PWM_Mode */

    uint16_t u16PclkDiv;            /*!< PCLK clock division of PWM timer. The PCLK division function is valid when clock source is PCLK
                                         This parameter can be a value of @ref TMR4_PWM_PCLK_Division */

    uint16_t u16TransformOcoPol;    /*!< TMR4 PWM transform OCO polarity
                                         This parameter can be a value of @ref TMR4_PWM_Transform_OCO_Polarity */

    uint32_t u32OxHPortOutMode;     /*!< TIM4_<t>_OxH port output mode
                                         This parameter can be a value of @ref TMR4_PWM_Port_Output_Mode */

    uint32_t u32EmbOxHPortState;    /*!< TIM4_<t>_OxH port state
                                         This parameter can be a value of @ref TMR4_PWM_EMB_Port_State */

    uint32_t u32OxLPortOutMode;     /*!< TIM4_<t>_OxL port output mode
                                         This parameter can be a value of @ref TMR4_PWM_Port_Output_Mode */

    uint32_t u32EmbOxLPortState;    /*!< TIM4_<t>_OxL port state
                                         This parameter can be a value of @ref TMR4_PWM_EMB_Port_State */
} stc_tmr4_pwm_init_t;

/**
 * @brief TMR4 Special-EVT initialization configuration
 */
typedef struct
{
    uint16_t u16CompareVal;         /*!< TMR4 Special-EVT compare match value.
                                         This parameter can be a value of half-word */

    uint16_t u16Mode;               /*!< Configure TMR4 Special-EVT Running mode
                                         This parameter can be a value of @ref TMR4_SEVT_Mode */

    uint16_t u16OutpuEvent;         /*!< TMR4 Special-EVT output event
                                         This parameter can be a value of @ref TMR4_SEVT_Output_Event */

    uint16_t u16BufMode;            /*!< Buffer mode
                                         This parameter can be a value of @ref TMR4_SEVT_Buffer_Mode */

    uint16_t u16LinkTransfer;       /*!< Enable or disable the buffer linked transfer with the CNT interrupt mask counter
                                         This parameter can be a value of @ref TMR4_SEVT_Link_Transfer */

    uint16_t u16UpMatchCmd;         /*!< Enable or disable trigger signal when match with SCCR&SCMR and TMR4 CNT count up
                                         This parameter can be a value of @ref TMR4_SEVT_Up_Selection */

    uint16_t u16DownMatchCmd;       /*!< Enable or disable trigger signal when match with SCCR&SCMR and TMR4 CNT count down
                                         This parameter can be a value of @ref TMR4_SEVT_Down_Selection */

    uint16_t u16PeakMatchCmd;       /*!< Enable or disable trigger signal when match with SCCR&SCMR and TMR4 CNT count peak
                                         This parameter can be a value of @ref TMR4_SEVT_Peak_Selection */

    uint16_t u16ZeroMatchCmd;       /*!< Enable or disable trigger signal when match with SCCR&SCMR and TMR4 CNT count zero
                                         This parameter can be a value of @ref TMR4_SEVT_Zero_Selection */

    uint16_t u16ZeroMatchMaskCmd;   /*!< Enable or disable perform to compare with the CNT zero interrupt mask counter
                                         This parameter can be a value of @ref TMR4_SEVT_Zero_Match_Mask_Selection */

    uint16_t u16PeakMatchMaskCmd;   /*!< Enable or disable perform to compare with the CNT peak interrupt mask counter
                                         This parameter can be a value of @ref TMR4_SEVT_Peak_Match_Mask_Selection */

    uint16_t u16MaskTimes;          /*!< Specifies start time by the value to be compared with the CNT interrupt mask counter */
} stc_tmr4_sevt_init_t;

/**
 * @}
 */

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TMR4_Global_Macros TMR4 Global Macros
 * @{
 */

/**
 * @defgroup TMR4_CNT_Macros TMR4 Counter Macros
 * @{
 */

/** @defgroup TMR4_CNT_PCLK_Division TMR4 Counter PCLK Clock Division
 * @{
 */
#define TMR4_CNT_PCLK_DIV1                      (0U)                    /*!< PCLK      */
#define TMR4_CNT_PCLK_DIV2                      (TMR4_CCSR_CKDIV_0)     /*!< PCLK/2    */
#define TMR4_CNT_PCLK_DIV4                      (TMR4_CCSR_CKDIV_1)     /*!< PCLK/4    */
#define TMR4_CNT_PCLK_DIV8                      (TMR4_CCSR_CKDIV_1 | \
                                                 TMR4_CCSR_CKDIV_0)     /*!< PCLK/8    */
#define TMR4_CNT_PCLK_DIV16                     (TMR4_CCSR_CKDIV_2)     /*!< PCLK/16   */
#define TMR4_CNT_PCLK_DIV32                     (TMR4_CCSR_CKDIV_2 | \
                                                 TMR4_CCSR_CKDIV_0)     /*!< PCLK/32   */
#define TMR4_CNT_PCLK_DIV64                     (TMR4_CCSR_CKDIV_2 | \
                                                 TMR4_CCSR_CKDIV_1)     /*!< PCLK/64   */
#define TMR4_CNT_PCLK_DIV128                    (TMR4_CCSR_CKDIV_2 | \
                                                 TMR4_CCSR_CKDIV_1 | \
                                                 TMR4_CCSR_CKDIV_0)     /*!< PCLK/128  */
#define TMR4_CNT_PCLK_DIV256                    (TMR4_CCSR_CKDIV_3)     /*!< PCLK/256  */
#define TMR4_CNT_PCLK_DIV512                    (TMR4_CCSR_CKDIV_3 | \
                                                 TMR4_CCSR_CKDIV_0)     /*!< PCLK/512  */
#define TMR4_CNT_PCLK_DIV1024                   (TMR4_CCSR_CKDIV_3 | \
                                                 TMR4_CCSR_CKDIV_1)     /*!< PCLK/1024 */
/**
 * @}
 */

/**
 * @defgroup TMR4_CNT_Mode TMR4 Counter Mode
 * @{
 */
#define TMR4_CNT_MODE_SAWTOOTH_WAVE             (0U)
#define TMR4_CNT_MODE_TRIANGLE_WAVE             (TMR4_CCSR_MODE)
/**
 * @}
 */

/**
 * @defgroup TMR4_CNT_Flag TMR4 Counter Flag
 * @{
 */
#define TMR4_CNT_FLAG_PEAK                      (TMR4_CCSR_IRQPF)
#define TMR4_CNT_FLAG_ZERO                      (TMR4_CCSR_IRQZF)
#define TMR4_CNT_FLAG_MASK                      (TMR4_CCSR_IRQPF | TMR4_CCSR_IRQZF)
/**
 * @}
 */

/**
 * @defgroup TMR4_CNT_Interrupt TMR4 Counter Interrupt
 * @{
 */
#define TMR4_CNT_INT_PEAK                       (TMR4_CCSR_IRQPEN)
#define TMR4_CNT_INT_ZERO                       (TMR4_CCSR_IRQZEN)
#define TMR4_CNT_INT_MASK                       (TMR4_CCSR_IRQPEN | TMR4_CCSR_IRQZEN)
/**
 * @}
 */

/**
 * @defgroup TMR4_CNT_Buffer_State TMR4 CNT Buffer State
 * @{
 */
#define TMR4_CNT_BUFFER_DISABLE                 (0U)                /*!< Disable TMR4 counter buffer function */
#define TMR4_CNT_BUFFER_ENABLE                  (TMR4_CCSR_BUFEN)   /*!< Enable TMR4 counter buffer function */
/**
 * @}
 */

/**
 * @defgroup TMR4_CNT_Clock_Source TMR4 Count Clock Source
 * @{
 */
#define TMR4_CNT_PCLK                           (0U)
#define TMR4_CNT_EXTCLK                         (TMR4_CCSR_ECKEN)
/**
 * @}
 */

/** @defgroup TMR4_CNT_Interrupt_Mask_Times TMR4 Counter Interrupt Mask Times
 * @{
 */
#define TMR4_CNT_INT_MASK_0                     (0U)    /*!< Counter interrupt flag is always set(not masked) for every counter count at "0x0000" */
#define TMR4_CNT_INT_MASK_1                     (1U)    /*!< Counter interrupt flag is set once for 2 for every counter counts at "0x0000" (skiping 1 count) */
#define TMR4_CNT_INT_MASK_2                     (2U)    /*!< Counter interrupt flag is set once for 3 for every counter counts at "0x0000" (skiping 2 count) */
#define TMR4_CNT_INT_MASK_3                     (3U)    /*!< Counter interrupt flag is set once for 4 for every counter counts at "0x0000" (skiping 3 count) */
#define TMR4_CNT_INT_MASK_4                     (4U)    /*!< Counter interrupt flag is set once for 5 for every counter counts at "0x0000" (skiping 4 count) */
#define TMR4_CNT_INT_MASK_5                     (5U)    /*!< Counter interrupt flag is set once for 6 for every counter counts at "0x0000" (skiping 5 count) */
#define TMR4_CNT_INT_MASK_6                     (6U)    /*!< Counter interrupt flag is set once for 7 for every counter counts at "0x0000" (skiping 6 count) */
#define TMR4_CNT_INT_MASK_7                     (7U)    /*!< Counter interrupt flag is set once for 8 for every counter counts at "0x0000" (skiping 7 count) */
#define TMR4_CNT_INT_MASK_8                     (8U)    /*!< Counter interrupt flag is set once for 9 for every counter counts at "0x0000" (skiping 8 count) */
#define TMR4_CNT_INT_MASK_9                     (9U)    /*!< Counter interrupt flag is set once for 10 for every counter counts at "0x0000" (skiping 9 count) */
#define TMR4_CNT_INT_MASK_10                    (10U)   /*!< Counter interrupt flag is set once for 11 for every counter counts at "0x0000" (skiping 10 count) */
#define TMR4_CNT_INT_MASK_11                    (11U)   /*!< Counter interrupt flag is set once for 12 for every counter counts at "0x0000" (skiping 11 count) */
#define TMR4_CNT_INT_MASK_12                    (12U)   /*!< Counter interrupt flag is set once for 13 for every counter counts at "0x0000" (skiping 12 count) */
#define TMR4_CNT_INT_MASK_13                    (13U)   /*!< Counter interrupt flag is set once for 14 for every counter counts at "0x0000" (skiping 13 count) */
#define TMR4_CNT_INT_MASK_14                    (14U)   /*!< Counter interrupt flag is set once for 15 for every counter counts at "0x0000" (skiping 14 count) */
#define TMR4_CNT_INT_MASK_15                    (15U)   /*!< Counter interrupt flag is set once for 16 for every counter counts at "0x0000" (skiping 15 count) */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @defgroup TMR4_OCO_Macros TMR4 Output Compare Macros
 * @{
 */

