levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/inc/hc32m423_tmr4.h
/** @defgroup TMR4_SEVT_Zero_Selection TMR4 SEVT Zero Selection
 * @{
 */
#define TMR4_SEVT_ZERO_DISABLE                  (0U)            /*!< Disable trigger signal when match with SCCR&SCMR and TMR4 CNT count zero */
#define TMR4_SEVT_ZERO_ENABLE                   (TMR4_SCSR_ZEN) /*!< Enable trigger signal when match with SCCR&SCMR and TMR4 CNT count zero */
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Zero_Match_Mask_Selection TMR4 SEVT Zero Match Mask Selection
 * @{
 */
#define TMR4_SEVT_ZERO_MATCH_MASK_DISABLE       (0U)            /*!< Disable perform to compare with the CNT zero interrupt mask counter */
#define TMR4_SEVT_ZERO_MATCH_MASK_ENABLE        (TMR4_SCSR_UEN) /*!< Enable perform to compare with the CNT zero interrupt mask counter */
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Peak_Match_Mask_Selection TMR4 SEVT Peak Match Mask Selection
 * @{
 */
#define TMR4_SEVT_PEAK_MATCH_MASK_DISABLE       (0U)            /*!< Disable perform to compare with the CNT peak interrupt mask counter */
#define TMR4_SEVT_PEAK_MATCH_MASK_ENABLE        (TMR4_SCSR_UEN) /*!< Enable perform to compare with the CNT peak interrupt mask counter */
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Buffer_Mode TMR4 SEVT Buffer Mode
 * @{
 */
#define TMR4_SEVT_BUF_DISABLE                   (0U)                /*!< Disable the register SCCR&SCMR buffer function */
#define TMR4_SEVT_BUF_CNT_ZERO                  (TMR4_SCSR_BUFEN_0) /*!< Register SCCR&SCMR buffer transfer when counter value is 0x0000 */
#define TMR4_SEVT_BUF_CNT_PEAK                  (TMR4_SCSR_BUFEN_1) /*!< Register SCCR&SCMR buffer transfer when counter value is CPSR */
#define TMR4_SEVT_BUF_CNT_ZERO_OR_PEAK          (TMR4_SCSR_BUFEN)   /*!< Register SCCR&SCMR buffer transfer when the value is both 0 and CPSR */
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Output_Event TMR4 SEVT Output Event
 * @{
 */
#define TMR4_SEVT_OUTPUT_EVENT0                 (0U)                    /*!< TMR4 SEVT output special event 0 */
#define TMR4_SEVT_OUTPUT_EVENT1                 (TMR4_SCSR_EVTOS_0)     /*!< TMR4 SEVT output special event 1 */
#define TMR4_SEVT_OUTPUT_EVENT2                 (TMR4_SCSR_EVTOS_1)     /*!< TMR4 SEVT output special event 2 */
#define TMR4_SEVT_OUTPUT_EVENT3                 (TMR4_SCSR_EVTOS_1 | \
                                                 TMR4_SCSR_EVTOS_0)     /*!< TMR4 SEVT output special event 3 */
#define TMR4_SEVT_OUTPUT_EVENT4                 (TMR4_SCSR_EVTOS_2)     /*!< TMR4 SEVT output special event 4 */
#define TMR4_SEVT_OUTPUT_EVENT5                 (TMR4_SCSR_EVTOS_2 | \
                                                 TMR4_SCSR_EVTOS_0)     /*!< TMR4 SEVT output special event 5 */
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Mode TMR4 SEVT Mode
 * @{
 */
#define TMR4_SEVT_MODE_COMPARE_TRIGGER          (0U)
#define TMR4_SEVT_MODE_DELAY_TRIGGER            (TMR4_SCSR_EVTMS)
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Delay_Object TMR4 SEVT Delay Object
 * @{
 */
#define TMR4_SEVT_DELAY_OCCRXH                  (0U)                /*!< TMR4 SEVT delay object: OCCRxh */
#define TMR4_SEVT_DELAY_OCCRXL                  (TMR4_SCSR_EVTDS)   /*!< TMR4 SEVT delay object: OCCRxl */
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Mask_Times TMR4 SEVT Mask Times
 * @{
 */
#define TMR4_SEVT_MASK_0                        (0U)    /*!< Mask 0 time */
#define TMR4_SEVT_MASK_1                        (1U)    /*!< Mask 1 times */
#define TMR4_SEVT_MASK_2                        (2U)    /*!< Mask 2 times */
#define TMR4_SEVT_MASK_3                        (3U)    /*!< Mask 3 times */
#define TMR4_SEVT_MASK_4                        (4U)    /*!< Mask 4 times */
#define TMR4_SEVT_MASK_5                        (5U)    /*!< Mask 5 times */
#define TMR4_SEVT_MASK_6                        (6U)    /*!< Mask 6 times */
#define TMR4_SEVT_MASK_7                        (7U)    /*!< Mask 7 times */
#define TMR4_SEVT_MASK_8                        (8U)    /*!< Mask 8 times */
#define TMR4_SEVT_MASK_9                        (9U)    /*!< Mask 9 times */
#define TMR4_SEVT_MASK_10                       (10U)   /*!< Mask 10 times */
#define TMR4_SEVT_MASK_11                       (11U)   /*!< Mask 11 times */
#define TMR4_SEVT_MASK_12                       (12U)   /*!< Mask 12 times */
#define TMR4_SEVT_MASK_13                       (13U)   /*!< Mask 13 times */
#define TMR4_SEVT_MASK_14                       (14U)   /*!< Mask 14 times */
#define TMR4_SEVT_MASK_15                       (15U)   /*!< Mask 15 times */
/**
 * @}
 */

/** @defgroup TMR4_SEVT_Port_Output_Event_Signal TMR4 SEVT Port Output Event Signal
 * @{
 */
#define TMR4_SEVT_PORT_OUTPUT_NONE              (0U)                    /*!< Disable output event signal of TMR4 Special-EVT */
#define TMR4_SEVT_PORT_OUTPUT_EVENT0_SIGNAL     (TMR4_SCER_EVTRS_0 )    /*!< Output the specified event 0 signal of TMR4 Special-EVT */
#define TMR4_SEVT_PORT_OUTPUT_EVENT1_SIGNAL     (TMR4_SCER_EVTRS_1)     /*!< Output the specified event 1 signal of TMR4 Special-EVT */
#define TMR4_SEVT_PORT_OUTPUT_EVENT2_SIGNAL     (TMR4_SCER_EVTRS_1 | \
                                                 TMR4_SCER_EVTRS_0)     /*!< Output the specified event 2 signal of TMR4 Special-EVT */
#define TMR4_SEVT_PORT_OUTPUT_EVENT3_SIGNAL     (TMR4_SCER_EVTRS_2)     /*!< Output the specified event 3 signal of TMR4 Special-EVT */
#define TMR4_SEVT_PORT_OUTPUT_EVENT4_SIGNAL     (TMR4_SCER_EVTRS_2 | \
                                                 TMR4_SCER_EVTRS_0)     /*!< Output the specified event 4 signal of TMR4 Special-EVT */
#define TMR4_SEVT_PORT_OUTPUT_EVENT5_SIGNAL     (TMR4_SCER_EVTRS_2 | \
                                                 TMR4_SCER_EVTRS_1)     /*!< Output the specified event 5 signal of TMR4 Special-EVT */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup TMR4_Global_Functions
 * @{
 */

/**
 * @addtogroup TMR4_CNT_Global_Functions
 * @{
 */

/* Initialization and configuration TMR4 counter functions */
en_result_t TMR4_CNT_Init(M4_TMR4_TypeDef *TMR4x,
                                const stc_tmr4_cnt_init_t *pstcInit);
en_result_t TMR4_CNT_StructInit(stc_tmr4_cnt_init_t *pstcInit);
void TMR4_CNT_DeInit(M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_SetClock(M4_TMR4_TypeDef *TMR4x, uint16_t u16ClkSrc);
uint16_t TMR4_CNT_GetClock(const M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_SetPclkDiv(M4_TMR4_TypeDef *TMR4x, uint16_t u16Div);
uint16_t TMR4_CNT_GetPclkDiv(const M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_SetMode(M4_TMR4_TypeDef *TMR4x, uint16_t u16Mode);
uint16_t TMR4_CNT_GetMode(const M4_TMR4_TypeDef *TMR4x);
en_flag_status_t TMR4_CNT_GetStatus(const M4_TMR4_TypeDef *TMR4x, uint16_t u16Flag);
void TMR4_CNT_ClearStatus(M4_TMR4_TypeDef *TMR4x, uint16_t u16Flag);
void TMR4_CNT_IntCmd(M4_TMR4_TypeDef *TMR4x,
                            uint16_t u16IntSource,
                            en_functional_state_t enNewState);
void TMR4_CNT_Start(M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_Stop(M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_SetCycleVal(M4_TMR4_TypeDef *TMR4x, uint16_t u16CycleVal);
uint16_t TMR4_CNT_GetCycleVal(const M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_ClearCountVal(M4_TMR4_TypeDef *TMR4x);
void TMR4_CNT_SetCountVal(M4_TMR4_TypeDef *TMR4x, uint16_t u16CountVal);
uint16_t TMR4_CNT_GetCountVal(const M4_TMR4_TypeDef *TMR4x);
en_result_t TMR4_CNT_SetIntMaskTimes(M4_TMR4_TypeDef *TMR4x,
                                        uint16_t u16IntSource,
                                        uint16_t u16MaskTimes);
en_result_t TMR4_CNT_GetIntMaskTimes(const M4_TMR4_TypeDef *TMR4x,
                                            uint16_t u16IntSource,
                                            uint16_t *pu16MaskTimes);
en_result_t TMR4_CNT_GetIntMaskCurrentTimes(const M4_TMR4_TypeDef *TMR4x,
                                                    uint16_t u16IntSource,
                                                    uint16_t *pu16MaskTimes);
void TMR4_CNT_PortOutputDirSigCmd(M4_TMR4_TypeDef *TMR4x,
                                        en_functional_state_t enNewState);
/**
 * @}
 */

/**
 * @addtogroup TMR4_OCO_Global_Functions
 * @{
 */

/* Initialization and configuration TMR4 OCO functions */
en_result_t TMR4_OCO_Init(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_tmr4_oco_init_t *pstcInit);
en_result_t TMR4_OCO_StructInit(stc_tmr4_oco_init_t *pstcInit);
void TMR4_OCO_DeInit(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_OCO_SetOccrBufMode(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                uint16_t u16OccrBufMode);
uint16_t TMR4_OCO_GetOccrBufMode(const M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch);
void TMR4_OCO_SetOccrLinkTransfer(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16TransferState);
void TMR4_OCO_SetOcmrBufMode(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16OcmrBufMode);
uint16_t TMR4_OCO_GetOcmrBufMode(const M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch);
void TMR4_OCO_SetOcmrLinkTransfer(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16TransferState);
void TMR4_OCO_SetExtMatchCond(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16ExtMatch);
en_result_t TMR4_OCO_SetHighChCompareMode(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_oco_high_ch_compare_mode_t *pstcMode);
en_result_t TMR4_OCO_SetLowChCompareMode(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_oco_low_ch_compare_mode_t *pstcMode);
void TMR4_OCO_SetOutputCompare(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16OcoCmd);
void TMR4_OCO_IntCmd(M4_TMR4_TypeDef *TMR4x,
                            uint32_t u32Ch,
                            en_functional_state_t enNewState);
en_flag_status_t TMR4_OCO_GetStatus(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch);
void TMR4_OCO_ClearStatus(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_OCO_SetOcoInvalidOp(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16OutputPolarity);
uint16_t TMR4_OCO_GetOutputPolarity(const M4_TMR4_TypeDef *TMR4x,
                                                uint32_t u32Ch);
void TMR4_OCO_SetCompareVal(M4_TMR4_TypeDef *TMR4x,
                                    uint32_t u32Ch,
                                    uint16_t u16CompareVal);
uint16_t TMR4_OCO_GetCompareVal(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch);
/**
 * @}
 */

/**
 * @addtogroup TMR4_PWM_Global_Functions
 * @{
 */

/* Initialization and configuration TMR4 PWM functions */
en_result_t TMR4_PWM_Init(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_tmr4_pwm_init_t *pstcInit);
en_result_t TMR4_PWM_StructInit(stc_tmr4_pwm_init_t *pstcInit);
void TMR4_PWM_DeInit(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_PWM_SetPclkDiv(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                uint16_t u16Div);
uint16_t TMR4_PWM_GetPclkDiv(const M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_PWM_SetOcoPolarityTransform(M4_TMR4_TypeDef *TMR4x,
                                                uint32_t u32Ch,
                                                uint16_t u16OcoPolTransform);
uint16_t TMR4_PWM_GetOcoPolarityTransform(const M4_TMR4_TypeDef *TMR4x,
                                                    uint32_t u32Ch);
void TMR4_PWM_StartReloadTimer(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_PWM_StopReloadTimer(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch);
void TMR4_PWM_IntCmd(M4_TMR4_TypeDef *TMR4x,
                            uint32_t u32Ch,
                            en_functional_state_t enNewState);
en_flag_status_t TMR4_PWM_GetStatus(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch);
void TMR4_PWM_ClearStatus(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch);
void TMR4_PWM_SetDeadRegionValue(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16PDAR,
                                            uint16_t u16PDBR);
void TMR4_PWM_GetDeadRegionValue(const M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t *pu16PDAR,
                                            uint16_t *pu16PDBR);
void TMR4_PWM_SetFilterCountValue(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch,
                                            uint16_t u16Count);
void TMR4_PWM_AutoOutputCmd(M4_TMR4_TypeDef *TMR4x,
                                        en_functional_state_t enNewState);
void TMR4_PWM_MasterOutputCmd(M4_TMR4_TypeDef *TMR4x,
                                        en_functional_state_t enNewState);
void TMR4_PWM_PortOutputMode(M4_TMR4_TypeDef *TMR4x,
                                    uint32_t u32PwmPort,
                                    uint32_t u32Mode);
void TMR4_PWM_SetPortEnBitEffectTime(M4_TMR4_TypeDef *TMR4x,
                                                    uint32_t u32EffectTime);
uint32_t TMR4_PWM_GetPortEnBitEffectTime(const M4_TMR4_TypeDef *TMR4x);
void TMR4_PWM_EmbPwmPortOutputState(M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32PwmPort,
                                            uint32_t u32State);
/**
 * @}
 */

/**
 * @addtogroup TMR4_SEVT_Global_Functions
 * @{
 */

